TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
/*
 * TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 * Copyright (c) 2022 Texas Instruments Incorporated
 *
 * All rights reserved not granted herein.
 *
 * Limited License.
 *
 * Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 * license under copyrights and patents it now or hereafter owns or controls to
 * make, have made, use, import, offer to sell and sell ("Utilize") this software
 * subject to the terms herein. With respect to the foregoing patent license,
 * such license is granted solely to the extent that any such patent is necessary
 * to Utilize the software alone. The patent license shall not apply to any
 * combinations which include this software, other than combinations with devices
 * manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 * Redistributions must preserve existing copyright notices and reproduce this license
 * (including the above copyright notice and the disclaimer and (if applicable) source
 * code license limitations below) in the documentation and/or other materials provided
 * with the distribution.
 *
 * Redistribution and use in binary form, without modification, are permitted provided
 * that the following conditions are met:
 * No reverse engineering, decompilation, or disassembly of this software is
 * permitted with respect to any software provided in binary form.
 * Any redistribution and use are licensed by TI for use only with TI Devices.
 * Nothing shall obligate TI to provide you with source code for the software
 * licensed and provided to you in object code.
 *
 * If software source code is provided to you, modification and redistribution of the
 * source code are permitted provided that the following conditions are met:
 * Any redistribution and use of the source code, including any resulting derivative
 * works, are licensed by TI for use only with TI Devices.
 * Any redistribution and use of any object code compiled from the source code
 * and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * DISCLAIMER.
 *
 * THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 * LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef HW_OSPI_H_
#define HW_OSPI_H_

#ifdef __cplusplus
extern "C"
{
#endif

/**************************************************************************
* Register Definitions
**************************************************************************/

#define OSPI_CONFIG_REG                                          (0x00000000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG                             (0x00000004U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG                             (0x00000008U)
#define OSPI_DEV_DELAY_REG                                       (0x0000000CU)
#define OSPI_RD_DATA_CAPTURE_REG                                 (0x00000010U)
#define OSPI_DEV_SIZE_CONFIG_REG                                 (0x00000014U)
#define OSPI_SRAM_PARTITION_CFG_REG                              (0x00000018U)
#define OSPI_IND_AHB_ADDR_TRIGGER_REG                            (0x0000001CU)
#define OSPI_DMA_PERIPH_CONFIG_REG                               (0x00000020U)
#define OSPI_REMAP_ADDR_REG                                      (0x00000024U)
#define OSPI_MODE_BIT_CONFIG_REG                                 (0x00000028U)
#define OSPI_SRAM_FILL_REG                                       (0x0000002CU)
#define OSPI_TX_THRESH_REG                                       (0x00000030U)
#define OSPI_RX_THRESH_REG                                       (0x00000034U)
#define OSPI_WRITE_COMPLETION_CTRL_REG                           (0x00000038U)
#define OSPI_NO_OF_POLLS_BEF_EXP_REG                             (0x0000003CU)
#define OSPI_IRQ_STATUS_REG                                      (0x00000040U)
#define OSPI_IRQ_MASK_REG                                        (0x00000044U)
#define OSPI_LOWER_WR_PROT_REG                                   (0x00000050U)
#define OSPI_UPPER_WR_PROT_REG                                   (0x00000054U)
#define OSPI_WR_PROT_CTRL_REG                                    (0x00000058U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG                         (0x00000060U)
#define OSPI_INDIRECT_READ_XFER_WATERMARK_REG                    (0x00000064U)
#define OSPI_INDIRECT_READ_XFER_START_REG                        (0x00000068U)
#define OSPI_INDIRECT_READ_XFER_NUM_BYTES_REG                    (0x0000006CU)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG                        (0x00000070U)
#define OSPI_INDIRECT_WRITE_XFER_WATERMARK_REG                   (0x00000074U)
#define OSPI_INDIRECT_WRITE_XFER_START_REG                       (0x00000078U)
#define OSPI_INDIRECT_WRITE_XFER_NUM_BYTES_REG                   (0x0000007CU)
#define OSPI_INDIRECT_TRIGGER_ADDR_RANGE_REG                     (0x00000080U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG                          (0x0000008CU)
#define OSPI_FLASH_CMD_CTRL_REG                                  (0x00000090U)
#define OSPI_FLASH_CMD_ADDR_REG                                  (0x00000094U)
#define OSPI_FLASH_RD_DATA_LOWER_REG                             (0x000000A0U)
#define OSPI_FLASH_RD_DATA_UPPER_REG                             (0x000000A4U)
#define OSPI_FLASH_WR_DATA_LOWER_REG                             (0x000000A8U)
#define OSPI_FLASH_WR_DATA_UPPER_REG                             (0x000000ACU)
#define OSPI_POLLING_FLASH_STATUS_REG                            (0x000000B0U)
#define OSPI_PHY_CONFIGURATION_REG                               (0x000000B4U)
#define OSPI_PHY_MASTER_CONTROL_REG                              (0x000000B8U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG                            (0x000000BCU)
#define OSPI_DLL_OBSERVABLE_UPPER_REG                            (0x000000C0U)
#define OSPI_OPCODE_EXT_LOWER_REG                                (0x000000E0U)
#define OSPI_OPCODE_EXT_UPPER_REG                                (0x000000E4U)
#define OSPI_MODULE_ID_REG                                       (0x000000FCU)

/**************************************************************************
* Field Definition Macros
**************************************************************************/


/* CONFIG_REG */

#define OSPI_CONFIG_REG_ENB_SPI_FLD_MASK                         (0x00000001U)
#define OSPI_CONFIG_REG_ENB_SPI_FLD_SHIFT                        (0x00000000U)
#define OSPI_CONFIG_REG_ENB_SPI_FLD_MAX                          (0x00000001U)

#define OSPI_CONFIG_REG_SEL_CLK_POL_FLD_MASK                     (0x00000002U)
#define OSPI_CONFIG_REG_SEL_CLK_POL_FLD_SHIFT                    (0x00000001U)
#define OSPI_CONFIG_REG_SEL_CLK_POL_FLD_MAX                      (0x00000001U)

#define OSPI_CONFIG_REG_SEL_CLK_PHASE_FLD_MASK                   (0x00000004U)
#define OSPI_CONFIG_REG_SEL_CLK_PHASE_FLD_SHIFT                  (0x00000002U)
#define OSPI_CONFIG_REG_SEL_CLK_PHASE_FLD_MAX                    (0x00000001U)

#define OSPI_CONFIG_REG_PHY_MODE_ENABLE_FLD_MASK                 (0x00000008U)
#define OSPI_CONFIG_REG_PHY_MODE_ENABLE_FLD_SHIFT                (0x00000003U)
#define OSPI_CONFIG_REG_PHY_MODE_ENABLE_FLD_MAX                  (0x00000001U)

