TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
#define OSPI_CONFIG_REG_HOLD_PIN_FLD_MASK                        (0x00000010U)
#define OSPI_CONFIG_REG_HOLD_PIN_FLD_SHIFT                       (0x00000004U)
#define OSPI_CONFIG_REG_HOLD_PIN_FLD_MAX                         (0x00000001U)

#define OSPI_CONFIG_REG_RESET_PIN_FLD_MASK                       (0x00000020U)
#define OSPI_CONFIG_REG_RESET_PIN_FLD_SHIFT                      (0x00000005U)
#define OSPI_CONFIG_REG_RESET_PIN_FLD_MAX                        (0x00000001U)

#define OSPI_CONFIG_REG_RESET_CFG_FLD_MASK                       (0x00000040U)
#define OSPI_CONFIG_REG_RESET_CFG_FLD_SHIFT                      (0x00000006U)
#define OSPI_CONFIG_REG_RESET_CFG_FLD_MAX                        (0x00000001U)

#define OSPI_CONFIG_REG_ENB_DIR_ACC_CTLR_FLD_MASK                (0x00000080U)
#define OSPI_CONFIG_REG_ENB_DIR_ACC_CTLR_FLD_SHIFT               (0x00000007U)
#define OSPI_CONFIG_REG_ENB_DIR_ACC_CTLR_FLD_MAX                 (0x00000001U)

#define OSPI_CONFIG_REG_ENB_LEGACY_IP_MODE_FLD_MASK              (0x00000100U)
#define OSPI_CONFIG_REG_ENB_LEGACY_IP_MODE_FLD_SHIFT             (0x00000008U)
#define OSPI_CONFIG_REG_ENB_LEGACY_IP_MODE_FLD_MAX               (0x00000001U)

#define OSPI_CONFIG_REG_PERIPH_SEL_DEC_FLD_MASK                  (0x00000200U)
#define OSPI_CONFIG_REG_PERIPH_SEL_DEC_FLD_SHIFT                 (0x00000009U)
#define OSPI_CONFIG_REG_PERIPH_SEL_DEC_FLD_MAX                   (0x00000001U)

#define OSPI_CONFIG_REG_PERIPH_CS_LINES_FLD_MASK                 (0x00003C00U)
#define OSPI_CONFIG_REG_PERIPH_CS_LINES_FLD_SHIFT                (0x0000000AU)
#define OSPI_CONFIG_REG_PERIPH_CS_LINES_FLD_MAX                  (0x0000000FU)

#define OSPI_CONFIG_REG_WR_PROT_FLASH_FLD_MASK                   (0x00004000U)
#define OSPI_CONFIG_REG_WR_PROT_FLASH_FLD_SHIFT                  (0x0000000EU)
#define OSPI_CONFIG_REG_WR_PROT_FLASH_FLD_MAX                    (0x00000001U)

#define OSPI_CONFIG_REG_ENB_DMA_IF_FLD_MASK                      (0x00008000U)
#define OSPI_CONFIG_REG_ENB_DMA_IF_FLD_SHIFT                     (0x0000000FU)
#define OSPI_CONFIG_REG_ENB_DMA_IF_FLD_MAX                       (0x00000001U)

#define OSPI_CONFIG_REG_ENB_AHB_ADDR_REMAP_FLD_MASK              (0x00010000U)
#define OSPI_CONFIG_REG_ENB_AHB_ADDR_REMAP_FLD_SHIFT             (0x00000010U)
#define OSPI_CONFIG_REG_ENB_AHB_ADDR_REMAP_FLD_MAX               (0x00000001U)

#define OSPI_CONFIG_REG_ENTER_XIP_MODE_FLD_MASK                  (0x00020000U)
#define OSPI_CONFIG_REG_ENTER_XIP_MODE_FLD_SHIFT                 (0x00000011U)
#define OSPI_CONFIG_REG_ENTER_XIP_MODE_FLD_MAX                   (0x00000001U)

#define OSPI_CONFIG_REG_ENTER_XIP_MODE_IMM_FLD_MASK              (0x00040000U)
#define OSPI_CONFIG_REG_ENTER_XIP_MODE_IMM_FLD_SHIFT             (0x00000012U)
#define OSPI_CONFIG_REG_ENTER_XIP_MODE_IMM_FLD_MAX               (0x00000001U)

#define OSPI_CONFIG_REG_MSTR_BAUD_DIV_FLD_MASK                   (0x00780000U)
#define OSPI_CONFIG_REG_MSTR_BAUD_DIV_FLD_SHIFT                  (0x00000013U)
#define OSPI_CONFIG_REG_MSTR_BAUD_DIV_FLD_MAX                    (0x0000000FU)

#define OSPI_CONFIG_REG_ENABLE_AHB_DECODER_FLD_MASK              (0x00800000U)
#define OSPI_CONFIG_REG_ENABLE_AHB_DECODER_FLD_SHIFT             (0x00000017U)
#define OSPI_CONFIG_REG_ENABLE_AHB_DECODER_FLD_MAX               (0x00000001U)

#define OSPI_CONFIG_REG_ENABLE_DTR_PROTOCOL_FLD_MASK             (0x01000000U)
#define OSPI_CONFIG_REG_ENABLE_DTR_PROTOCOL_FLD_SHIFT            (0x00000018U)
#define OSPI_CONFIG_REG_ENABLE_DTR_PROTOCOL_FLD_MAX              (0x00000001U)

#define OSPI_CONFIG_REG_PIPELINE_PHY_FLD_MASK                    (0x02000000U)
#define OSPI_CONFIG_REG_PIPELINE_PHY_FLD_SHIFT                   (0x00000019U)
#define OSPI_CONFIG_REG_PIPELINE_PHY_FLD_MAX                     (0x00000001U)

#define OSPI_CONFIG_REG_CONFIG_RESV2_FLD_MASK                    (0x1C000000U)
#define OSPI_CONFIG_REG_CONFIG_RESV2_FLD_SHIFT                   (0x0000001AU)
#define OSPI_CONFIG_REG_CONFIG_RESV2_FLD_MAX                     (0x00000007U)

#define OSPI_CONFIG_REG_CRC_ENABLE_FLD_MASK                      (0x20000000U)
#define OSPI_CONFIG_REG_CRC_ENABLE_FLD_SHIFT                     (0x0000001DU)
#define OSPI_CONFIG_REG_CRC_ENABLE_FLD_MAX                       (0x00000001U)

#define OSPI_CONFIG_REG_DUAL_BYTE_OPCODE_EN_FLD_MASK             (0x40000000U)
#define OSPI_CONFIG_REG_DUAL_BYTE_OPCODE_EN_FLD_SHIFT            (0x0000001EU)
#define OSPI_CONFIG_REG_DUAL_BYTE_OPCODE_EN_FLD_MAX              (0x00000001U)

#define OSPI_CONFIG_REG_IDLE_FLD_MASK                            (0x80000000U)
#define OSPI_CONFIG_REG_IDLE_FLD_SHIFT                           (0x0000001FU)
#define OSPI_CONFIG_REG_IDLE_FLD_MAX                             (0x00000001U)

/* DEV_INSTR_RD_CONFIG_REG */

#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_OPCODE_NON_XIP_FLD_MASK  (0x000000FFU)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_OPCODE_NON_XIP_FLD_SHIFT (0x00000000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_OPCODE_NON_XIP_FLD_MAX   (0x000000FFU)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_INSTR_TYPE_FLD_MASK         (0x00000300U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_INSTR_TYPE_FLD_SHIFT        (0x00000008U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_INSTR_TYPE_FLD_MAX          (0x00000003U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_DDR_EN_FLD_MASK             (0x00000400U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_DDR_EN_FLD_SHIFT            (0x0000000AU)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_DDR_EN_FLD_MAX              (0x00000001U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV1_FLD_MASK     (0x00000800U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV1_FLD_SHIFT    (0x0000000BU)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV1_FLD_MAX      (0x00000001U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_ADDR_XFER_TYPE_STD_MODE_FLD_MASK (0x00003000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_ADDR_XFER_TYPE_STD_MODE_FLD_SHIFT (0x0000000CU)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_ADDR_XFER_TYPE_STD_MODE_FLD_MAX (0x00000003U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV2_FLD_MASK     (0x0000C000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV2_FLD_SHIFT    (0x0000000EU)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV2_FLD_MAX      (0x00000003U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_DATA_XFER_TYPE_EXT_MODE_FLD_MASK (0x00030000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_DATA_XFER_TYPE_EXT_MODE_FLD_SHIFT (0x00000010U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_DATA_XFER_TYPE_EXT_MODE_FLD_MAX (0x00000003U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV3_FLD_MASK     (0x000C0000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV3_FLD_SHIFT    (0x00000012U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV3_FLD_MAX      (0x00000003U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_MODE_BIT_ENABLE_FLD_MASK    (0x00100000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_MODE_BIT_ENABLE_FLD_SHIFT   (0x00000014U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_MODE_BIT_ENABLE_FLD_MAX     (0x00000001U)

