TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV4_FLD_MASK     (0x00E00000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV4_FLD_SHIFT    (0x00000015U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV4_FLD_MAX      (0x00000007U)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_DUMMY_RD_CLK_CYCLES_FLD_MASK (0x1F000000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_DUMMY_RD_CLK_CYCLES_FLD_SHIFT (0x00000018U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_DUMMY_RD_CLK_CYCLES_FLD_MAX (0x0000001FU)

#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV5_FLD_MASK     (0xE0000000U)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV5_FLD_SHIFT    (0x0000001DU)
#define OSPI_DEV_INSTR_RD_CONFIG_REG_RD_INSTR_RESV5_FLD_MAX      (0x00000007U)

/* DEV_INSTR_WR_CONFIG_REG */

#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_OPCODE_FLD_MASK          (0x000000FFU)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_OPCODE_FLD_SHIFT         (0x00000000U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_OPCODE_FLD_MAX           (0x000000FFU)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_WEL_DIS_FLD_MASK            (0x00000100U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WEL_DIS_FLD_SHIFT           (0x00000008U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WEL_DIS_FLD_MAX             (0x00000001U)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV1_FLD_MASK     (0x00000E00U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV1_FLD_SHIFT    (0x00000009U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV1_FLD_MAX      (0x00000007U)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_ADDR_XFER_TYPE_STD_MODE_FLD_MASK (0x00003000U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_ADDR_XFER_TYPE_STD_MODE_FLD_SHIFT (0x0000000CU)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_ADDR_XFER_TYPE_STD_MODE_FLD_MAX (0x00000003U)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV2_FLD_MASK     (0x0000C000U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV2_FLD_SHIFT    (0x0000000EU)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV2_FLD_MAX      (0x00000003U)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_DATA_XFER_TYPE_EXT_MODE_FLD_MASK (0x00030000U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_DATA_XFER_TYPE_EXT_MODE_FLD_SHIFT (0x00000010U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_DATA_XFER_TYPE_EXT_MODE_FLD_MAX (0x00000003U)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV3_FLD_MASK     (0x00FC0000U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV3_FLD_SHIFT    (0x00000012U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV3_FLD_MAX      (0x0000003FU)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_DUMMY_WR_CLK_CYCLES_FLD_MASK (0x1F000000U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_DUMMY_WR_CLK_CYCLES_FLD_SHIFT (0x00000018U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_DUMMY_WR_CLK_CYCLES_FLD_MAX (0x0000001FU)

#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV4_FLD_MASK     (0xE0000000U)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV4_FLD_SHIFT    (0x0000001DU)
#define OSPI_DEV_INSTR_WR_CONFIG_REG_WR_INSTR_RESV4_FLD_MAX      (0x00000007U)

/* DEV_DELAY_REG */

#define OSPI_DEV_DELAY_REG_D_INIT_FLD_MASK                       (0x000000FFU)
#define OSPI_DEV_DELAY_REG_D_INIT_FLD_SHIFT                      (0x00000000U)
#define OSPI_DEV_DELAY_REG_D_INIT_FLD_MAX                        (0x000000FFU)

#define OSPI_DEV_DELAY_REG_D_AFTER_FLD_MASK                      (0x0000FF00U)
#define OSPI_DEV_DELAY_REG_D_AFTER_FLD_SHIFT                     (0x00000008U)
#define OSPI_DEV_DELAY_REG_D_AFTER_FLD_MAX                       (0x000000FFU)

#define OSPI_DEV_DELAY_REG_D_BTWN_FLD_MASK                       (0x00FF0000U)
#define OSPI_DEV_DELAY_REG_D_BTWN_FLD_SHIFT                      (0x00000010U)
#define OSPI_DEV_DELAY_REG_D_BTWN_FLD_MAX                        (0x000000FFU)

#define OSPI_DEV_DELAY_REG_D_NSS_FLD_MASK                        (0xFF000000U)
#define OSPI_DEV_DELAY_REG_D_NSS_FLD_SHIFT                       (0x00000018U)
#define OSPI_DEV_DELAY_REG_D_NSS_FLD_MAX                         (0x000000FFU)

/* RD_DATA_CAPTURE_REG */

#define OSPI_RD_DATA_CAPTURE_REG_BYPASS_FLD_MASK                 (0x00000001U)
#define OSPI_RD_DATA_CAPTURE_REG_BYPASS_FLD_SHIFT                (0x00000000U)
#define OSPI_RD_DATA_CAPTURE_REG_BYPASS_FLD_MAX                  (0x00000001U)

#define OSPI_RD_DATA_CAPTURE_REG_DELAY_FLD_MASK                  (0x0000001EU)
#define OSPI_RD_DATA_CAPTURE_REG_DELAY_FLD_SHIFT                 (0x00000001U)
#define OSPI_RD_DATA_CAPTURE_REG_DELAY_FLD_MAX                   (0x0000000FU)

#define OSPI_RD_DATA_CAPTURE_REG_SAMPLE_EDGE_SEL_FLD_MASK        (0x00000020U)
#define OSPI_RD_DATA_CAPTURE_REG_SAMPLE_EDGE_SEL_FLD_SHIFT       (0x00000005U)
#define OSPI_RD_DATA_CAPTURE_REG_SAMPLE_EDGE_SEL_FLD_MAX         (0x00000001U)

#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV1_FLD_MASK          (0x000000C0U)
#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV1_FLD_SHIFT         (0x00000006U)
#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV1_FLD_MAX           (0x00000003U)

#define OSPI_RD_DATA_CAPTURE_REG_DQS_ENABLE_FLD_MASK             (0x00000100U)
#define OSPI_RD_DATA_CAPTURE_REG_DQS_ENABLE_FLD_SHIFT            (0x00000008U)
#define OSPI_RD_DATA_CAPTURE_REG_DQS_ENABLE_FLD_MAX              (0x00000001U)

#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV2_FLD_MASK          (0x0000FE00U)
#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV2_FLD_SHIFT         (0x00000009U)
#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV2_FLD_MAX           (0x0000007FU)

#define OSPI_RD_DATA_CAPTURE_REG_DDR_READ_DELAY_FLD_MASK         (0x000F0000U)
#define OSPI_RD_DATA_CAPTURE_REG_DDR_READ_DELAY_FLD_SHIFT        (0x00000010U)
#define OSPI_RD_DATA_CAPTURE_REG_DDR_READ_DELAY_FLD_MAX          (0x0000000FU)

#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV3_FLD_MASK          (0xFFF00000U)
#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV3_FLD_SHIFT         (0x00000014U)
#define OSPI_RD_DATA_CAPTURE_REG_RD_DATA_RESV3_FLD_MAX           (0x00000FFFU)

/* DEV_SIZE_CONFIG_REG */

#define OSPI_DEV_SIZE_CONFIG_REG_NUM_ADDR_BYTES_FLD_MASK         (0x0000000FU)
#define OSPI_DEV_SIZE_CONFIG_REG_NUM_ADDR_BYTES_FLD_SHIFT        (0x00000000U)
#define OSPI_DEV_SIZE_CONFIG_REG_NUM_ADDR_BYTES_FLD_MAX          (0x0000000FU)

#define OSPI_DEV_SIZE_CONFIG_REG_BYTES_PER_DEVICE_PAGE_FLD_MASK  (0x0000FFF0U)
#define OSPI_DEV_SIZE_CONFIG_REG_BYTES_PER_DEVICE_PAGE_FLD_SHIFT (0x00000004U)
#define OSPI_DEV_SIZE_CONFIG_REG_BYTES_PER_DEVICE_PAGE_FLD_MAX   (0x00000FFFU)

#define OSPI_DEV_SIZE_CONFIG_REG_BYTES_PER_SUBSECTOR_FLD_MASK    (0x001F0000U)
#define OSPI_DEV_SIZE_CONFIG_REG_BYTES_PER_SUBSECTOR_FLD_SHIFT   (0x00000010U)
#define OSPI_DEV_SIZE_CONFIG_REG_BYTES_PER_SUBSECTOR_FLD_MAX     (0x0000001FU)

#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS0_FLD_MASK        (0x00600000U)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS0_FLD_SHIFT       (0x00000015U)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS0_FLD_MAX         (0x00000003U)

#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS1_FLD_MASK        (0x01800000U)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS1_FLD_SHIFT       (0x00000017U)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS1_FLD_MAX         (0x00000003U)

#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS2_FLD_MASK        (0x06000000U)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS2_FLD_SHIFT       (0x00000019U)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS2_FLD_MAX         (0x00000003U)

#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS3_FLD_MASK        (0x18000000U)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS3_FLD_SHIFT       (0x0000001BU)
#define OSPI_DEV_SIZE_CONFIG_REG_MEM_SIZE_ON_CS3_FLD_MAX         (0x00000003U)

#define OSPI_DEV_SIZE_CONFIG_REG_DEV_SIZE_RESV_FLD_MASK          (0xE0000000U)
#define OSPI_DEV_SIZE_CONFIG_REG_DEV_SIZE_RESV_FLD_SHIFT         (0x0000001DU)
#define OSPI_DEV_SIZE_CONFIG_REG_DEV_SIZE_RESV_FLD_MAX           (0x00000007U)

/* SRAM_PARTITION_CFG_REG */

#define OSPI_SRAM_PARTITION_CFG_REG_ADDR_FLD_MASK                (0x000000FFU)
#define OSPI_SRAM_PARTITION_CFG_REG_ADDR_FLD_SHIFT               (0x00000000U)
#define OSPI_SRAM_PARTITION_CFG_REG_ADDR_FLD_MAX                 (0x000000FFU)

#define OSPI_SRAM_PARTITION_CFG_REG_SRAM_PARTITION_RESV_FLD_MASK (0xFFFFFF00U)
#define OSPI_SRAM_PARTITION_CFG_REG_SRAM_PARTITION_RESV_FLD_SHIFT (0x00000008U)
#define OSPI_SRAM_PARTITION_CFG_REG_SRAM_PARTITION_RESV_FLD_MAX  (0x00FFFFFFU)

/* IND_AHB_ADDR_TRIGGER_REG */

#define OSPI_IND_AHB_ADDR_TRIGGER_REG_ADDR_FLD_MASK              (0xFFFFFFFFU)
#define OSPI_IND_AHB_ADDR_TRIGGER_REG_ADDR_FLD_SHIFT             (0x00000000U)
#define OSPI_IND_AHB_ADDR_TRIGGER_REG_ADDR_FLD_MAX               (0xFFFFFFFFU)

/* DMA_PERIPH_CONFIG_REG */

#define OSPI_DMA_PERIPH_CONFIG_REG_NUM_SINGLE_REQ_BYTES_FLD_MASK (0x0000000FU)
#define OSPI_DMA_PERIPH_CONFIG_REG_NUM_SINGLE_REQ_BYTES_FLD_SHIFT (0x00000000U)
#define OSPI_DMA_PERIPH_CONFIG_REG_NUM_SINGLE_REQ_BYTES_FLD_MAX  (0x0000000FU)

#define OSPI_DMA_PERIPH_CONFIG_REG_DMA_PERIPH_RESV1_FLD_MASK     (0x000000F0U)
#define OSPI_DMA_PERIPH_CONFIG_REG_DMA_PERIPH_RESV1_FLD_SHIFT    (0x00000004U)
#define OSPI_DMA_PERIPH_CONFIG_REG_DMA_PERIPH_RESV1_FLD_MAX      (0x0000000FU)

#define OSPI_DMA_PERIPH_CONFIG_REG_NUM_BURST_REQ_BYTES_FLD_MASK  (0x00000F00U)
#define OSPI_DMA_PERIPH_CONFIG_REG_NUM_BURST_REQ_BYTES_FLD_SHIFT (0x00000008U)
#define OSPI_DMA_PERIPH_CONFIG_REG_NUM_BURST_REQ_BYTES_FLD_MAX   (0x0000000FU)

#define OSPI_DMA_PERIPH_CONFIG_REG_DMA_PERIPH_RESV2_FLD_MASK     (0xFFFFF000U)
#define OSPI_DMA_PERIPH_CONFIG_REG_DMA_PERIPH_RESV2_FLD_SHIFT    (0x0000000CU)
#define OSPI_DMA_PERIPH_CONFIG_REG_DMA_PERIPH_RESV2_FLD_MAX      (0x000FFFFFU)

