TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
/* REMAP_ADDR_REG */

#define OSPI_REMAP_ADDR_REG_VALUE_FLD_MASK                       (0xFFFFFFFFU)
#define OSPI_REMAP_ADDR_REG_VALUE_FLD_SHIFT                      (0x00000000U)
#define OSPI_REMAP_ADDR_REG_VALUE_FLD_MAX                        (0xFFFFFFFFU)

/* MODE_BIT_CONFIG_REG */

#define OSPI_MODE_BIT_CONFIG_REG_MODE_FLD_MASK                   (0x000000FFU)
#define OSPI_MODE_BIT_CONFIG_REG_MODE_FLD_SHIFT                  (0x00000000U)
#define OSPI_MODE_BIT_CONFIG_REG_MODE_FLD_MAX                    (0x000000FFU)

#define OSPI_MODE_BIT_CONFIG_REG_CHUNK_SIZE_FLD_MASK             (0x00000700U)
#define OSPI_MODE_BIT_CONFIG_REG_CHUNK_SIZE_FLD_SHIFT            (0x00000008U)
#define OSPI_MODE_BIT_CONFIG_REG_CHUNK_SIZE_FLD_MAX              (0x00000007U)

#define OSPI_MODE_BIT_CONFIG_REG_MODE_BIT_RESV1_FLD_MASK         (0x00007800U)
#define OSPI_MODE_BIT_CONFIG_REG_MODE_BIT_RESV1_FLD_SHIFT        (0x0000000BU)
#define OSPI_MODE_BIT_CONFIG_REG_MODE_BIT_RESV1_FLD_MAX          (0x0000000FU)

#define OSPI_MODE_BIT_CONFIG_REG_CRC_OUT_ENABLE_FLD_MASK         (0x00008000U)
#define OSPI_MODE_BIT_CONFIG_REG_CRC_OUT_ENABLE_FLD_SHIFT        (0x0000000FU)
#define OSPI_MODE_BIT_CONFIG_REG_CRC_OUT_ENABLE_FLD_MAX          (0x00000001U)

#define OSPI_MODE_BIT_CONFIG_REG_RX_CRC_DATA_UP_FLD_MASK         (0x00FF0000U)
#define OSPI_MODE_BIT_CONFIG_REG_RX_CRC_DATA_UP_FLD_SHIFT        (0x00000010U)
#define OSPI_MODE_BIT_CONFIG_REG_RX_CRC_DATA_UP_FLD_MAX          (0x000000FFU)

#define OSPI_MODE_BIT_CONFIG_REG_RX_CRC_DATA_LOW_FLD_MASK        (0xFF000000U)
#define OSPI_MODE_BIT_CONFIG_REG_RX_CRC_DATA_LOW_FLD_SHIFT       (0x00000018U)
#define OSPI_MODE_BIT_CONFIG_REG_RX_CRC_DATA_LOW_FLD_MAX         (0x000000FFU)

/* SRAM_FILL_REG */

#define OSPI_SRAM_FILL_REG_SRAM_FILL_INDAC_READ_FLD_MASK         (0x0000FFFFU)
#define OSPI_SRAM_FILL_REG_SRAM_FILL_INDAC_READ_FLD_SHIFT        (0x00000000U)
#define OSPI_SRAM_FILL_REG_SRAM_FILL_INDAC_READ_FLD_MAX          (0x0000FFFFU)

#define OSPI_SRAM_FILL_REG_SRAM_FILL_INDAC_WRITE_FLD_MASK        (0xFFFF0000U)
#define OSPI_SRAM_FILL_REG_SRAM_FILL_INDAC_WRITE_FLD_SHIFT       (0x00000010U)
#define OSPI_SRAM_FILL_REG_SRAM_FILL_INDAC_WRITE_FLD_MAX         (0x0000FFFFU)

/* TX_THRESH_REG */

#define OSPI_TX_THRESH_REG_LEVEL_FLD_MASK                        (0x0000001FU)
#define OSPI_TX_THRESH_REG_LEVEL_FLD_SHIFT                       (0x00000000U)
#define OSPI_TX_THRESH_REG_LEVEL_FLD_MAX                         (0x0000001FU)

#define OSPI_TX_THRESH_REG_TX_THRESH_RESV_FLD_MASK               (0xFFFFFFE0U)
#define OSPI_TX_THRESH_REG_TX_THRESH_RESV_FLD_SHIFT              (0x00000005U)
#define OSPI_TX_THRESH_REG_TX_THRESH_RESV_FLD_MAX                (0x07FFFFFFU)

/* RX_THRESH_REG */

#define OSPI_RX_THRESH_REG_LEVEL_FLD_MASK                        (0x0000001FU)
#define OSPI_RX_THRESH_REG_LEVEL_FLD_SHIFT                       (0x00000000U)
#define OSPI_RX_THRESH_REG_LEVEL_FLD_MAX                         (0x0000001FU)

#define OSPI_RX_THRESH_REG_RX_THRESH_RESV_FLD_MASK               (0xFFFFFFE0U)
#define OSPI_RX_THRESH_REG_RX_THRESH_RESV_FLD_SHIFT              (0x00000005U)
#define OSPI_RX_THRESH_REG_RX_THRESH_RESV_FLD_MAX                (0x07FFFFFFU)

/* WRITE_COMPLETION_CTRL_REG */

#define OSPI_WRITE_COMPLETION_CTRL_REG_OPCODE_FLD_MASK           (0x000000FFU)
#define OSPI_WRITE_COMPLETION_CTRL_REG_OPCODE_FLD_SHIFT          (0x00000000U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_OPCODE_FLD_MAX            (0x000000FFU)

#define OSPI_WRITE_COMPLETION_CTRL_REG_POLLING_BIT_INDEX_FLD_MASK (0x00000700U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLLING_BIT_INDEX_FLD_SHIFT (0x00000008U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLLING_BIT_INDEX_FLD_MAX (0x00000007U)

#define OSPI_WRITE_COMPLETION_CTRL_REG_WR_COMP_CTRL_RESV1_FLD_MASK (0x00001800U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_WR_COMP_CTRL_RESV1_FLD_SHIFT (0x0000000BU)
#define OSPI_WRITE_COMPLETION_CTRL_REG_WR_COMP_CTRL_RESV1_FLD_MAX (0x00000003U)

#define OSPI_WRITE_COMPLETION_CTRL_REG_POLLING_POLARITY_FLD_MASK (0x00002000U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLLING_POLARITY_FLD_SHIFT (0x0000000DU)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLLING_POLARITY_FLD_MAX  (0x00000001U)

#define OSPI_WRITE_COMPLETION_CTRL_REG_DISABLE_POLLING_FLD_MASK  (0x00004000U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_DISABLE_POLLING_FLD_SHIFT (0x0000000EU)
#define OSPI_WRITE_COMPLETION_CTRL_REG_DISABLE_POLLING_FLD_MAX   (0x00000001U)

#define OSPI_WRITE_COMPLETION_CTRL_REG_ENABLE_POLLING_EXP_FLD_MASK (0x00008000U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_ENABLE_POLLING_EXP_FLD_SHIFT (0x0000000FU)
#define OSPI_WRITE_COMPLETION_CTRL_REG_ENABLE_POLLING_EXP_FLD_MAX (0x00000001U)

#define OSPI_WRITE_COMPLETION_CTRL_REG_POLL_COUNT_FLD_MASK       (0x00FF0000U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLL_COUNT_FLD_SHIFT      (0x00000010U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLL_COUNT_FLD_MAX        (0x000000FFU)

#define OSPI_WRITE_COMPLETION_CTRL_REG_POLL_REP_DELAY_FLD_MASK   (0xFF000000U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLL_REP_DELAY_FLD_SHIFT  (0x00000018U)
#define OSPI_WRITE_COMPLETION_CTRL_REG_POLL_REP_DELAY_FLD_MAX    (0x000000FFU)

/* NO_OF_POLLS_BEF_EXP_REG */

#define OSPI_NO_OF_POLLS_BEF_EXP_REG_NO_OF_POLLS_BEF_EXP_FLD_MASK (0xFFFFFFFFU)
#define OSPI_NO_OF_POLLS_BEF_EXP_REG_NO_OF_POLLS_BEF_EXP_FLD_SHIFT (0x00000000U)
#define OSPI_NO_OF_POLLS_BEF_EXP_REG_NO_OF_POLLS_BEF_EXP_FLD_MAX (0xFFFFFFFFU)

/* IRQ_STATUS_REG */

#define OSPI_IRQ_STATUS_REG_MODE_M_FAIL_FLD_MASK                 (0x00000001U)
#define OSPI_IRQ_STATUS_REG_MODE_M_FAIL_FLD_SHIFT                (0x00000000U)
#define OSPI_IRQ_STATUS_REG_MODE_M_FAIL_FLD_MAX                  (0x00000001U)

#define OSPI_IRQ_STATUS_REG_UNDERFLOW_DET_FLD_MASK               (0x00000002U)
#define OSPI_IRQ_STATUS_REG_UNDERFLOW_DET_FLD_SHIFT              (0x00000001U)
#define OSPI_IRQ_STATUS_REG_UNDERFLOW_DET_FLD_MAX                (0x00000001U)

#define OSPI_IRQ_STATUS_REG_INDIRECT_OP_DONE_FLD_MASK            (0x00000004U)
#define OSPI_IRQ_STATUS_REG_INDIRECT_OP_DONE_FLD_SHIFT           (0x00000002U)
#define OSPI_IRQ_STATUS_REG_INDIRECT_OP_DONE_FLD_MAX             (0x00000001U)

#define OSPI_IRQ_STATUS_REG_INDIRECT_READ_REJECT_FLD_MASK        (0x00000008U)
#define OSPI_IRQ_STATUS_REG_INDIRECT_READ_REJECT_FLD_SHIFT       (0x00000003U)
#define OSPI_IRQ_STATUS_REG_INDIRECT_READ_REJECT_FLD_MAX         (0x00000001U)

#define OSPI_IRQ_STATUS_REG_PROT_WR_ATTEMPT_FLD_MASK             (0x00000010U)
#define OSPI_IRQ_STATUS_REG_PROT_WR_ATTEMPT_FLD_SHIFT            (0x00000004U)
#define OSPI_IRQ_STATUS_REG_PROT_WR_ATTEMPT_FLD_MAX              (0x00000001U)

#define OSPI_IRQ_STATUS_REG_ILLEGAL_ACCESS_DET_FLD_MASK          (0x00000020U)
#define OSPI_IRQ_STATUS_REG_ILLEGAL_ACCESS_DET_FLD_SHIFT         (0x00000005U)
#define OSPI_IRQ_STATUS_REG_ILLEGAL_ACCESS_DET_FLD_MAX           (0x00000001U)

