TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
#define OSPI_IRQ_STATUS_REG_INDIRECT_XFER_LEVEL_BREACH_FLD_MASK  (0x00000040U)
#define OSPI_IRQ_STATUS_REG_INDIRECT_XFER_LEVEL_BREACH_FLD_SHIFT (0x00000006U)
#define OSPI_IRQ_STATUS_REG_INDIRECT_XFER_LEVEL_BREACH_FLD_MAX   (0x00000001U)

#define OSPI_IRQ_STATUS_REG_RECV_OVERFLOW_FLD_MASK               (0x00000080U)
#define OSPI_IRQ_STATUS_REG_RECV_OVERFLOW_FLD_SHIFT              (0x00000007U)
#define OSPI_IRQ_STATUS_REG_RECV_OVERFLOW_FLD_MAX                (0x00000001U)

#define OSPI_IRQ_STATUS_REG_TX_FIFO_NOT_FULL_FLD_MASK            (0x00000100U)
#define OSPI_IRQ_STATUS_REG_TX_FIFO_NOT_FULL_FLD_SHIFT           (0x00000008U)
#define OSPI_IRQ_STATUS_REG_TX_FIFO_NOT_FULL_FLD_MAX             (0x00000001U)

#define OSPI_IRQ_STATUS_REG_TX_FIFO_FULL_FLD_MASK                (0x00000200U)
#define OSPI_IRQ_STATUS_REG_TX_FIFO_FULL_FLD_SHIFT               (0x00000009U)
#define OSPI_IRQ_STATUS_REG_TX_FIFO_FULL_FLD_MAX                 (0x00000001U)

#define OSPI_IRQ_STATUS_REG_RX_FIFO_NOT_EMPTY_FLD_MASK           (0x00000400U)
#define OSPI_IRQ_STATUS_REG_RX_FIFO_NOT_EMPTY_FLD_SHIFT          (0x0000000AU)
#define OSPI_IRQ_STATUS_REG_RX_FIFO_NOT_EMPTY_FLD_MAX            (0x00000001U)

#define OSPI_IRQ_STATUS_REG_RX_FIFO_FULL_FLD_MASK                (0x00000800U)
#define OSPI_IRQ_STATUS_REG_RX_FIFO_FULL_FLD_SHIFT               (0x0000000BU)
#define OSPI_IRQ_STATUS_REG_RX_FIFO_FULL_FLD_MAX                 (0x00000001U)

#define OSPI_IRQ_STATUS_REG_INDRD_SRAM_FULL_FLD_MASK             (0x00001000U)
#define OSPI_IRQ_STATUS_REG_INDRD_SRAM_FULL_FLD_SHIFT            (0x0000000CU)
#define OSPI_IRQ_STATUS_REG_INDRD_SRAM_FULL_FLD_MAX              (0x00000001U)

#define OSPI_IRQ_STATUS_REG_POLL_EXP_INT_FLD_MASK                (0x00002000U)
#define OSPI_IRQ_STATUS_REG_POLL_EXP_INT_FLD_SHIFT               (0x0000000DU)
#define OSPI_IRQ_STATUS_REG_POLL_EXP_INT_FLD_MAX                 (0x00000001U)

#define OSPI_IRQ_STATUS_REG_STIG_REQ_INT_FLD_MASK                (0x00004000U)
#define OSPI_IRQ_STATUS_REG_STIG_REQ_INT_FLD_SHIFT               (0x0000000EU)
#define OSPI_IRQ_STATUS_REG_STIG_REQ_INT_FLD_MAX                 (0x00000001U)

#define OSPI_IRQ_STATUS_REG_IRQ_STAT_RESV1_FLD_MASK              (0x00008000U)
#define OSPI_IRQ_STATUS_REG_IRQ_STAT_RESV1_FLD_SHIFT             (0x0000000FU)
#define OSPI_IRQ_STATUS_REG_IRQ_STAT_RESV1_FLD_MAX               (0x00000001U)

#define OSPI_IRQ_STATUS_REG_RX_CRC_DATA_ERR_FLD_MASK             (0x00010000U)
#define OSPI_IRQ_STATUS_REG_RX_CRC_DATA_ERR_FLD_SHIFT            (0x00000010U)
#define OSPI_IRQ_STATUS_REG_RX_CRC_DATA_ERR_FLD_MAX              (0x00000001U)

#define OSPI_IRQ_STATUS_REG_RX_CRC_DATA_VAL_FLD_MASK             (0x00020000U)
#define OSPI_IRQ_STATUS_REG_RX_CRC_DATA_VAL_FLD_SHIFT            (0x00000011U)
#define OSPI_IRQ_STATUS_REG_RX_CRC_DATA_VAL_FLD_MAX              (0x00000001U)

#define OSPI_IRQ_STATUS_REG_TX_CRC_CHUNK_BRK_FLD_MASK            (0x00040000U)
#define OSPI_IRQ_STATUS_REG_TX_CRC_CHUNK_BRK_FLD_SHIFT           (0x00000012U)
#define OSPI_IRQ_STATUS_REG_TX_CRC_CHUNK_BRK_FLD_MAX             (0x00000001U)

#define OSPI_IRQ_STATUS_REG_ECC_FAIL_FLD_MASK                    (0x00080000U)
#define OSPI_IRQ_STATUS_REG_ECC_FAIL_FLD_SHIFT                   (0x00000013U)
#define OSPI_IRQ_STATUS_REG_ECC_FAIL_FLD_MAX                     (0x00000001U)

#define OSPI_IRQ_STATUS_REG_IRQ_STAT_RESV_FLD_MASK               (0xFFF00000U)
#define OSPI_IRQ_STATUS_REG_IRQ_STAT_RESV_FLD_SHIFT              (0x00000014U)
#define OSPI_IRQ_STATUS_REG_IRQ_STAT_RESV_FLD_MAX                (0x00000FFFU)

/* IRQ_MASK_REG */

#define OSPI_IRQ_MASK_REG_MODE_M_FAIL_MASK_FLD_MASK              (0x00000001U)
#define OSPI_IRQ_MASK_REG_MODE_M_FAIL_MASK_FLD_SHIFT             (0x00000000U)
#define OSPI_IRQ_MASK_REG_MODE_M_FAIL_MASK_FLD_MAX               (0x00000001U)

#define OSPI_IRQ_MASK_REG_UNDERFLOW_DET_MASK_FLD_MASK            (0x00000002U)
#define OSPI_IRQ_MASK_REG_UNDERFLOW_DET_MASK_FLD_SHIFT           (0x00000001U)
#define OSPI_IRQ_MASK_REG_UNDERFLOW_DET_MASK_FLD_MAX             (0x00000001U)

#define OSPI_IRQ_MASK_REG_INDIRECT_OP_DONE_MASK_FLD_MASK         (0x00000004U)
#define OSPI_IRQ_MASK_REG_INDIRECT_OP_DONE_MASK_FLD_SHIFT        (0x00000002U)
#define OSPI_IRQ_MASK_REG_INDIRECT_OP_DONE_MASK_FLD_MAX          (0x00000001U)

#define OSPI_IRQ_MASK_REG_INDIRECT_READ_REJECT_MASK_FLD_MASK     (0x00000008U)
#define OSPI_IRQ_MASK_REG_INDIRECT_READ_REJECT_MASK_FLD_SHIFT    (0x00000003U)
#define OSPI_IRQ_MASK_REG_INDIRECT_READ_REJECT_MASK_FLD_MAX      (0x00000001U)

#define OSPI_IRQ_MASK_REG_PROT_WR_ATTEMPT_MASK_FLD_MASK          (0x00000010U)
#define OSPI_IRQ_MASK_REG_PROT_WR_ATTEMPT_MASK_FLD_SHIFT         (0x00000004U)
#define OSPI_IRQ_MASK_REG_PROT_WR_ATTEMPT_MASK_FLD_MAX           (0x00000001U)

#define OSPI_IRQ_MASK_REG_ILLEGAL_ACCESS_DET_MASK_FLD_MASK       (0x00000020U)
#define OSPI_IRQ_MASK_REG_ILLEGAL_ACCESS_DET_MASK_FLD_SHIFT      (0x00000005U)
#define OSPI_IRQ_MASK_REG_ILLEGAL_ACCESS_DET_MASK_FLD_MAX        (0x00000001U)

#define OSPI_IRQ_MASK_REG_INDIRECT_XFER_LEVEL_BREACH_MASK_FLD_MASK (0x00000040U)
#define OSPI_IRQ_MASK_REG_INDIRECT_XFER_LEVEL_BREACH_MASK_FLD_SHIFT (0x00000006U)
#define OSPI_IRQ_MASK_REG_INDIRECT_XFER_LEVEL_BREACH_MASK_FLD_MAX (0x00000001U)

#define OSPI_IRQ_MASK_REG_RECV_OVERFLOW_MASK_FLD_MASK            (0x00000080U)
#define OSPI_IRQ_MASK_REG_RECV_OVERFLOW_MASK_FLD_SHIFT           (0x00000007U)
#define OSPI_IRQ_MASK_REG_RECV_OVERFLOW_MASK_FLD_MAX             (0x00000001U)

#define OSPI_IRQ_MASK_REG_TX_FIFO_NOT_FULL_MASK_FLD_MASK         (0x00000100U)
#define OSPI_IRQ_MASK_REG_TX_FIFO_NOT_FULL_MASK_FLD_SHIFT        (0x00000008U)
#define OSPI_IRQ_MASK_REG_TX_FIFO_NOT_FULL_MASK_FLD_MAX          (0x00000001U)

#define OSPI_IRQ_MASK_REG_TX_FIFO_FULL_MASK_FLD_MASK             (0x00000200U)
#define OSPI_IRQ_MASK_REG_TX_FIFO_FULL_MASK_FLD_SHIFT            (0x00000009U)
#define OSPI_IRQ_MASK_REG_TX_FIFO_FULL_MASK_FLD_MAX              (0x00000001U)

#define OSPI_IRQ_MASK_REG_RX_FIFO_NOT_EMPTY_MASK_FLD_MASK        (0x00000400U)
#define OSPI_IRQ_MASK_REG_RX_FIFO_NOT_EMPTY_MASK_FLD_SHIFT       (0x0000000AU)
#define OSPI_IRQ_MASK_REG_RX_FIFO_NOT_EMPTY_MASK_FLD_MAX         (0x00000001U)

#define OSPI_IRQ_MASK_REG_RX_FIFO_FULL_MASK_FLD_MASK             (0x00000800U)
#define OSPI_IRQ_MASK_REG_RX_FIFO_FULL_MASK_FLD_SHIFT            (0x0000000BU)
#define OSPI_IRQ_MASK_REG_RX_FIFO_FULL_MASK_FLD_MAX              (0x00000001U)

#define OSPI_IRQ_MASK_REG_INDRD_SRAM_FULL_MASK_FLD_MASK          (0x00001000U)
#define OSPI_IRQ_MASK_REG_INDRD_SRAM_FULL_MASK_FLD_SHIFT         (0x0000000CU)
#define OSPI_IRQ_MASK_REG_INDRD_SRAM_FULL_MASK_FLD_MAX           (0x00000001U)

#define OSPI_IRQ_MASK_REG_POLL_EXP_INT_MASK_FLD_MASK             (0x00002000U)
#define OSPI_IRQ_MASK_REG_POLL_EXP_INT_MASK_FLD_SHIFT            (0x0000000DU)
#define OSPI_IRQ_MASK_REG_POLL_EXP_INT_MASK_FLD_MAX              (0x00000001U)

