TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
#define OSPI_IRQ_MASK_REG_STIG_REQ_MASK_FLD_MASK                 (0x00004000U)
#define OSPI_IRQ_MASK_REG_STIG_REQ_MASK_FLD_SHIFT                (0x0000000EU)
#define OSPI_IRQ_MASK_REG_STIG_REQ_MASK_FLD_MAX                  (0x00000001U)

#define OSPI_IRQ_MASK_REG_IRQ_MASK_RESV1_FLD_MASK                (0x00008000U)
#define OSPI_IRQ_MASK_REG_IRQ_MASK_RESV1_FLD_SHIFT               (0x0000000FU)
#define OSPI_IRQ_MASK_REG_IRQ_MASK_RESV1_FLD_MAX                 (0x00000001U)

#define OSPI_IRQ_MASK_REG_RX_CRC_DATA_ERR_MASK_FLD_MASK          (0x00010000U)
#define OSPI_IRQ_MASK_REG_RX_CRC_DATA_ERR_MASK_FLD_SHIFT         (0x00000010U)
#define OSPI_IRQ_MASK_REG_RX_CRC_DATA_ERR_MASK_FLD_MAX           (0x00000001U)

#define OSPI_IRQ_MASK_REG_RX_CRC_DATA_VAL_MASK_FLD_MASK          (0x00020000U)
#define OSPI_IRQ_MASK_REG_RX_CRC_DATA_VAL_MASK_FLD_SHIFT         (0x00000011U)
#define OSPI_IRQ_MASK_REG_RX_CRC_DATA_VAL_MASK_FLD_MAX           (0x00000001U)

#define OSPI_IRQ_MASK_REG_TX_CRC_CHUNK_BRK_MASK_FLD_MASK         (0x00040000U)
#define OSPI_IRQ_MASK_REG_TX_CRC_CHUNK_BRK_MASK_FLD_SHIFT        (0x00000012U)
#define OSPI_IRQ_MASK_REG_TX_CRC_CHUNK_BRK_MASK_FLD_MAX          (0x00000001U)

#define OSPI_IRQ_MASK_REG_ECC_FAIL_MASK_FLD_MASK                 (0x00080000U)
#define OSPI_IRQ_MASK_REG_ECC_FAIL_MASK_FLD_SHIFT                (0x00000013U)
#define OSPI_IRQ_MASK_REG_ECC_FAIL_MASK_FLD_MAX                  (0x00000001U)

#define OSPI_IRQ_MASK_REG_IRQ_MASK_RESV_FLD_MASK                 (0xFFF00000U)
#define OSPI_IRQ_MASK_REG_IRQ_MASK_RESV_FLD_SHIFT                (0x00000014U)
#define OSPI_IRQ_MASK_REG_IRQ_MASK_RESV_FLD_MAX                  (0x00000FFFU)

/* LOWER_WR_PROT_REG */

#define OSPI_LOWER_WR_PROT_REG_SUBSECTOR_FLD_MASK                (0xFFFFFFFFU)
#define OSPI_LOWER_WR_PROT_REG_SUBSECTOR_FLD_SHIFT               (0x00000000U)
#define OSPI_LOWER_WR_PROT_REG_SUBSECTOR_FLD_MAX                 (0xFFFFFFFFU)

/* UPPER_WR_PROT_REG */

#define OSPI_UPPER_WR_PROT_REG_SUBSECTOR_FLD_MASK                (0xFFFFFFFFU)
#define OSPI_UPPER_WR_PROT_REG_SUBSECTOR_FLD_SHIFT               (0x00000000U)
#define OSPI_UPPER_WR_PROT_REG_SUBSECTOR_FLD_MAX                 (0xFFFFFFFFU)

/* WR_PROT_CTRL_REG */

#define OSPI_WR_PROT_CTRL_REG_INV_FLD_MASK                       (0x00000001U)
#define OSPI_WR_PROT_CTRL_REG_INV_FLD_SHIFT                      (0x00000000U)
#define OSPI_WR_PROT_CTRL_REG_INV_FLD_MAX                        (0x00000001U)

#define OSPI_WR_PROT_CTRL_REG_ENB_FLD_MASK                       (0x00000002U)
#define OSPI_WR_PROT_CTRL_REG_ENB_FLD_SHIFT                      (0x00000001U)
#define OSPI_WR_PROT_CTRL_REG_ENB_FLD_MAX                        (0x00000001U)

#define OSPI_WR_PROT_CTRL_REG_WR_PROT_CTRL_RESV_FLD_MASK         (0xFFFFFFFCU)
#define OSPI_WR_PROT_CTRL_REG_WR_PROT_CTRL_RESV_FLD_SHIFT        (0x00000002U)
#define OSPI_WR_PROT_CTRL_REG_WR_PROT_CTRL_RESV_FLD_MAX          (0x3FFFFFFFU)

/* INDIRECT_READ_XFER_CTRL_REG */

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_START_FLD_MASK          (0x00000001U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_START_FLD_SHIFT         (0x00000000U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_START_FLD_MAX           (0x00000001U)

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_CANCEL_FLD_MASK         (0x00000002U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_CANCEL_FLD_SHIFT        (0x00000001U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_CANCEL_FLD_MAX          (0x00000001U)

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_RD_STATUS_FLD_MASK      (0x00000004U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_RD_STATUS_FLD_SHIFT     (0x00000002U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_RD_STATUS_FLD_MAX       (0x00000001U)

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_SRAM_FULL_FLD_MASK      (0x00000008U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_SRAM_FULL_FLD_SHIFT     (0x00000003U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_SRAM_FULL_FLD_MAX       (0x00000001U)

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_RD_QUEUED_FLD_MASK      (0x00000010U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_RD_QUEUED_FLD_SHIFT     (0x00000004U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_RD_QUEUED_FLD_MAX       (0x00000001U)

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_IND_OPS_DONE_STATUS_FLD_MASK (0x00000020U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_IND_OPS_DONE_STATUS_FLD_SHIFT (0x00000005U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_IND_OPS_DONE_STATUS_FLD_MAX (0x00000001U)

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_NUM_IND_OPS_DONE_FLD_MASK (0x000000C0U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_NUM_IND_OPS_DONE_FLD_SHIFT (0x00000006U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_NUM_IND_OPS_DONE_FLD_MAX (0x00000003U)

#define OSPI_INDIRECT_READ_XFER_CTRL_REG_INDIR_RD_XFER_RESV_FLD_MASK (0xFFFFFF00U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_INDIR_RD_XFER_RESV_FLD_SHIFT (0x00000008U)
#define OSPI_INDIRECT_READ_XFER_CTRL_REG_INDIR_RD_XFER_RESV_FLD_MAX (0x00FFFFFFU)

/* INDIRECT_READ_XFER_WATERMARK_REG */

#define OSPI_INDIRECT_READ_XFER_WATERMARK_REG_LEVEL_FLD_MASK     (0xFFFFFFFFU)
#define OSPI_INDIRECT_READ_XFER_WATERMARK_REG_LEVEL_FLD_SHIFT    (0x00000000U)
#define OSPI_INDIRECT_READ_XFER_WATERMARK_REG_LEVEL_FLD_MAX      (0xFFFFFFFFU)

/* INDIRECT_READ_XFER_START_REG */

#define OSPI_INDIRECT_READ_XFER_START_REG_ADDR_FLD_MASK          (0xFFFFFFFFU)
#define OSPI_INDIRECT_READ_XFER_START_REG_ADDR_FLD_SHIFT         (0x00000000U)
#define OSPI_INDIRECT_READ_XFER_START_REG_ADDR_FLD_MAX           (0xFFFFFFFFU)

/* INDIRECT_READ_XFER_NUM_BYTES_REG */

#define OSPI_INDIRECT_READ_XFER_NUM_BYTES_REG_VALUE_FLD_MASK     (0xFFFFFFFFU)
#define OSPI_INDIRECT_READ_XFER_NUM_BYTES_REG_VALUE_FLD_SHIFT    (0x00000000U)
#define OSPI_INDIRECT_READ_XFER_NUM_BYTES_REG_VALUE_FLD_MAX      (0xFFFFFFFFU)

/* INDIRECT_WRITE_XFER_CTRL_REG */

#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_START_FLD_MASK         (0x00000001U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_START_FLD_SHIFT        (0x00000000U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_START_FLD_MAX          (0x00000001U)

