TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_CANCEL_FLD_MASK        (0x00000002U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_CANCEL_FLD_SHIFT       (0x00000001U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_CANCEL_FLD_MAX         (0x00000001U)

#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_WR_STATUS_FLD_MASK     (0x00000004U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_WR_STATUS_FLD_SHIFT    (0x00000002U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_WR_STATUS_FLD_MAX      (0x00000001U)

#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_INDIR_WR_XFER_RESV1_FLD_MASK (0x00000008U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_INDIR_WR_XFER_RESV1_FLD_SHIFT (0x00000003U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_INDIR_WR_XFER_RESV1_FLD_MAX (0x00000001U)

#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_WR_QUEUED_FLD_MASK     (0x00000010U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_WR_QUEUED_FLD_SHIFT    (0x00000004U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_WR_QUEUED_FLD_MAX      (0x00000001U)

#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_IND_OPS_DONE_STATUS_FLD_MASK (0x00000020U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_IND_OPS_DONE_STATUS_FLD_SHIFT (0x00000005U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_IND_OPS_DONE_STATUS_FLD_MAX (0x00000001U)

#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_NUM_IND_OPS_DONE_FLD_MASK (0x000000C0U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_NUM_IND_OPS_DONE_FLD_SHIFT (0x00000006U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_NUM_IND_OPS_DONE_FLD_MAX (0x00000003U)

#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_INDIR_WR_XFER_RESV2_FLD_MASK (0xFFFFFF00U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_INDIR_WR_XFER_RESV2_FLD_SHIFT (0x00000008U)
#define OSPI_INDIRECT_WRITE_XFER_CTRL_REG_INDIR_WR_XFER_RESV2_FLD_MAX (0x00FFFFFFU)

/* INDIRECT_WRITE_XFER_WATERMARK_REG */

#define OSPI_INDIRECT_WRITE_XFER_WATERMARK_REG_LEVEL_FLD_MASK    (0xFFFFFFFFU)
#define OSPI_INDIRECT_WRITE_XFER_WATERMARK_REG_LEVEL_FLD_SHIFT   (0x00000000U)
#define OSPI_INDIRECT_WRITE_XFER_WATERMARK_REG_LEVEL_FLD_MAX     (0xFFFFFFFFU)

/* INDIRECT_WRITE_XFER_START_REG */

#define OSPI_INDIRECT_WRITE_XFER_START_REG_ADDR_FLD_MASK         (0xFFFFFFFFU)
#define OSPI_INDIRECT_WRITE_XFER_START_REG_ADDR_FLD_SHIFT        (0x00000000U)
#define OSPI_INDIRECT_WRITE_XFER_START_REG_ADDR_FLD_MAX          (0xFFFFFFFFU)

/* INDIRECT_WRITE_XFER_NUM_BYTES_REG */

#define OSPI_INDIRECT_WRITE_XFER_NUM_BYTES_REG_VALUE_FLD_MASK    (0xFFFFFFFFU)
#define OSPI_INDIRECT_WRITE_XFER_NUM_BYTES_REG_VALUE_FLD_SHIFT   (0x00000000U)
#define OSPI_INDIRECT_WRITE_XFER_NUM_BYTES_REG_VALUE_FLD_MAX     (0xFFFFFFFFU)

/* INDIRECT_TRIGGER_ADDR_RANGE_REG */

#define OSPI_INDIRECT_TRIGGER_ADDR_RANGE_REG_IND_RANGE_WIDTH_FLD_MASK (0x0000000FU)
#define OSPI_INDIRECT_TRIGGER_ADDR_RANGE_REG_IND_RANGE_WIDTH_FLD_SHIFT (0x00000000U)
#define OSPI_INDIRECT_TRIGGER_ADDR_RANGE_REG_IND_RANGE_WIDTH_FLD_MAX (0x0000000FU)

#define OSPI_INDIRECT_TRIGGER_ADDR_RANGE_REG_IND_RANGE_RESV1_FLD_MASK (0xFFFFFFF0U)
#define OSPI_INDIRECT_TRIGGER_ADDR_RANGE_REG_IND_RANGE_RESV1_FLD_SHIFT (0x00000004U)
#define OSPI_INDIRECT_TRIGGER_ADDR_RANGE_REG_IND_RANGE_RESV1_FLD_MAX (0x0FFFFFFFU)

/* FLASH_COMMAND_CTRL_MEM_REG */

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_TRIGGER_MEM_BANK_REQ_FLD_MASK (0x00000001U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_TRIGGER_MEM_BANK_REQ_FLD_SHIFT (0x00000000U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_TRIGGER_MEM_BANK_REQ_FLD_MAX (0x00000001U)

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_REQ_IN_PROGRESS_FLD_MASK (0x00000002U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_REQ_IN_PROGRESS_FLD_SHIFT (0x00000001U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_REQ_IN_PROGRESS_FLD_MAX (0x00000001U)

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV3_FLD_MASK (0x000000FCU)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV3_FLD_SHIFT (0x00000002U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV3_FLD_MAX (0x0000003FU)

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_READ_DATA_FLD_MASK (0x0000FF00U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_READ_DATA_FLD_SHIFT (0x00000008U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_READ_DATA_FLD_MAX (0x000000FFU)

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_NB_OF_STIG_READ_BYTES_FLD_MASK (0x00070000U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_NB_OF_STIG_READ_BYTES_FLD_SHIFT (0x00000010U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_NB_OF_STIG_READ_BYTES_FLD_MAX (0x00000007U)

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV2_FLD_MASK (0x00080000U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV2_FLD_SHIFT (0x00000013U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV2_FLD_MAX (0x00000001U)

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_ADDR_FLD_MASK   (0x1FF00000U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_ADDR_FLD_SHIFT  (0x00000014U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_MEM_BANK_ADDR_FLD_MAX    (0x000001FFU)

#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV1_FLD_MASK (0xE0000000U)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV1_FLD_SHIFT (0x0000001DU)
#define OSPI_FLASH_COMMAND_CTRL_MEM_REG_FLASH_COMMAND_CTRL_MEM_RESV1_FLD_MAX (0x00000007U)

/* FLASH_CMD_CTRL_REG */

#define OSPI_FLASH_CMD_CTRL_REG_CMD_EXEC_FLD_MASK                (0x00000001U)
#define OSPI_FLASH_CMD_CTRL_REG_CMD_EXEC_FLD_SHIFT               (0x00000000U)
#define OSPI_FLASH_CMD_CTRL_REG_CMD_EXEC_FLD_MAX                 (0x00000001U)

#define OSPI_FLASH_CMD_CTRL_REG_CMD_EXEC_STATUS_FLD_MASK         (0x00000002U)
#define OSPI_FLASH_CMD_CTRL_REG_CMD_EXEC_STATUS_FLD_SHIFT        (0x00000001U)
#define OSPI_FLASH_CMD_CTRL_REG_CMD_EXEC_STATUS_FLD_MAX          (0x00000001U)

#define OSPI_FLASH_CMD_CTRL_REG_STIG_MEM_BANK_EN_FLD_MASK        (0x00000004U)
#define OSPI_FLASH_CMD_CTRL_REG_STIG_MEM_BANK_EN_FLD_SHIFT       (0x00000002U)
#define OSPI_FLASH_CMD_CTRL_REG_STIG_MEM_BANK_EN_FLD_MAX         (0x00000001U)

#define OSPI_FLASH_CMD_CTRL_REG_FLASH_CMD_CTRL_RESV1_FLD_MASK    (0x00000078U)
#define OSPI_FLASH_CMD_CTRL_REG_FLASH_CMD_CTRL_RESV1_FLD_SHIFT   (0x00000003U)
#define OSPI_FLASH_CMD_CTRL_REG_FLASH_CMD_CTRL_RESV1_FLD_MAX     (0x0000000FU)

#define OSPI_FLASH_CMD_CTRL_REG_NUM_DUMMY_CYCLES_FLD_MASK        (0x00000F80U)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_DUMMY_CYCLES_FLD_SHIFT       (0x00000007U)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_DUMMY_CYCLES_FLD_MAX         (0x0000001FU)

#define OSPI_FLASH_CMD_CTRL_REG_NUM_WR_DATA_BYTES_FLD_MASK       (0x00007000U)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_WR_DATA_BYTES_FLD_SHIFT      (0x0000000CU)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_WR_DATA_BYTES_FLD_MAX        (0x00000007U)

#define OSPI_FLASH_CMD_CTRL_REG_ENB_WRITE_DATA_FLD_MASK          (0x00008000U)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_WRITE_DATA_FLD_SHIFT         (0x0000000FU)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_WRITE_DATA_FLD_MAX           (0x00000001U)

#define OSPI_FLASH_CMD_CTRL_REG_NUM_ADDR_BYTES_FLD_MASK          (0x00030000U)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_ADDR_BYTES_FLD_SHIFT         (0x00000010U)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_ADDR_BYTES_FLD_MAX           (0x00000003U)

#define OSPI_FLASH_CMD_CTRL_REG_ENB_MODE_BIT_FLD_MASK            (0x00040000U)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_MODE_BIT_FLD_SHIFT           (0x00000012U)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_MODE_BIT_FLD_MAX             (0x00000001U)

#define OSPI_FLASH_CMD_CTRL_REG_ENB_COMD_ADDR_FLD_MASK           (0x00080000U)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_COMD_ADDR_FLD_SHIFT          (0x00000013U)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_COMD_ADDR_FLD_MAX            (0x00000001U)

#define OSPI_FLASH_CMD_CTRL_REG_NUM_RD_DATA_BYTES_FLD_MASK       (0x00700000U)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_RD_DATA_BYTES_FLD_SHIFT      (0x00000014U)
#define OSPI_FLASH_CMD_CTRL_REG_NUM_RD_DATA_BYTES_FLD_MAX        (0x00000007U)

#define OSPI_FLASH_CMD_CTRL_REG_ENB_READ_DATA_FLD_MASK           (0x00800000U)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_READ_DATA_FLD_SHIFT          (0x00000017U)
#define OSPI_FLASH_CMD_CTRL_REG_ENB_READ_DATA_FLD_MAX            (0x00000001U)

#define OSPI_FLASH_CMD_CTRL_REG_CMD_OPCODE_FLD_MASK              (0xFF000000U)
#define OSPI_FLASH_CMD_CTRL_REG_CMD_OPCODE_FLD_SHIFT             (0x00000018U)
#define OSPI_FLASH_CMD_CTRL_REG_CMD_OPCODE_FLD_MAX               (0x000000FFU)

/* FLASH_CMD_ADDR_REG */

#define OSPI_FLASH_CMD_ADDR_REG_ADDR_FLD_MASK                    (0xFFFFFFFFU)
#define OSPI_FLASH_CMD_ADDR_REG_ADDR_FLD_SHIFT                   (0x00000000U)
#define OSPI_FLASH_CMD_ADDR_REG_ADDR_FLD_MAX                     (0xFFFFFFFFU)

/* FLASH_RD_DATA_LOWER_REG */

#define OSPI_FLASH_RD_DATA_LOWER_REG_DATA_FLD_MASK               (0xFFFFFFFFU)
#define OSPI_FLASH_RD_DATA_LOWER_REG_DATA_FLD_SHIFT              (0x00000000U)
#define OSPI_FLASH_RD_DATA_LOWER_REG_DATA_FLD_MAX                (0xFFFFFFFFU)

