TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
/* FLASH_RD_DATA_UPPER_REG */

#define OSPI_FLASH_RD_DATA_UPPER_REG_DATA_FLD_MASK               (0xFFFFFFFFU)
#define OSPI_FLASH_RD_DATA_UPPER_REG_DATA_FLD_SHIFT              (0x00000000U)
#define OSPI_FLASH_RD_DATA_UPPER_REG_DATA_FLD_MAX                (0xFFFFFFFFU)

/* FLASH_WR_DATA_LOWER_REG */

#define OSPI_FLASH_WR_DATA_LOWER_REG_DATA_FLD_MASK               (0xFFFFFFFFU)
#define OSPI_FLASH_WR_DATA_LOWER_REG_DATA_FLD_SHIFT              (0x00000000U)
#define OSPI_FLASH_WR_DATA_LOWER_REG_DATA_FLD_MAX                (0xFFFFFFFFU)

/* FLASH_WR_DATA_UPPER_REG */

#define OSPI_FLASH_WR_DATA_UPPER_REG_DATA_FLD_MASK               (0xFFFFFFFFU)
#define OSPI_FLASH_WR_DATA_UPPER_REG_DATA_FLD_SHIFT              (0x00000000U)
#define OSPI_FLASH_WR_DATA_UPPER_REG_DATA_FLD_MAX                (0xFFFFFFFFU)

/* POLLING_FLASH_STATUS_REG */

#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_FLD_MASK     (0x000000FFU)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_FLD_SHIFT    (0x00000000U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_FLD_MAX      (0x000000FFU)

#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_VALID_FLD_MASK (0x00000100U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_VALID_FLD_SHIFT (0x00000008U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_VALID_FLD_MAX (0x00000001U)

#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_RSVD_FLD1_MASK (0x0000FE00U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_RSVD_FLD1_SHIFT (0x00000009U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_RSVD_FLD1_MAX (0x0000007FU)

#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_NB_DUMMY_MASK (0x000F0000U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_NB_DUMMY_SHIFT (0x00000010U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_NB_DUMMY_MAX (0x0000000FU)

#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_RSVD_FLD2_MASK (0xFFF00000U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_RSVD_FLD2_SHIFT (0x00000014U)
#define OSPI_POLLING_FLASH_STATUS_REG_DEVICE_STATUS_RSVD_FLD2_MAX (0x00000FFFU)

/* PHY_CONFIGURATION_REG */

#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RX_DLL_DELAY_FLD_MASK (0x0000007FU)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RX_DLL_DELAY_FLD_SHIFT (0x00000000U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RX_DLL_DELAY_FLD_MAX (0x0000007FU)

#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESV1_FLD_MASK     (0x0000FF80U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESV1_FLD_SHIFT    (0x00000007U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESV1_FLD_MAX      (0x000001FFU)

#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_TX_DLL_DELAY_FLD_MASK (0x007F0000U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_TX_DLL_DELAY_FLD_SHIFT (0x00000010U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_TX_DLL_DELAY_FLD_MAX (0x0000007FU)

#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESV2_FLD_MASK     (0x1F800000U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESV2_FLD_SHIFT    (0x00000017U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESV2_FLD_MAX      (0x0000003FU)

#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RX_DLL_BYPASS_FLD_MASK (0x20000000U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RX_DLL_BYPASS_FLD_SHIFT (0x0000001DU)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RX_DLL_BYPASS_FLD_MAX (0x00000001U)

#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESET_FLD_MASK     (0x40000000U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESET_FLD_SHIFT    (0x0000001EU)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESET_FLD_MAX      (0x00000001U)

#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESYNC_FLD_MASK    (0x80000000U)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESYNC_FLD_SHIFT   (0x0000001FU)
#define OSPI_PHY_CONFIGURATION_REG_PHY_CONFIG_RESYNC_FLD_MAX     (0x00000001U)

/* PHY_MASTER_CONTROL_REG */

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_INITIAL_DELAY_FLD_MASK (0x0000007FU)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_INITIAL_DELAY_FLD_SHIFT (0x00000000U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_INITIAL_DELAY_FLD_MAX (0x0000007FU)

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV1_FLD_MASK (0x0000FF80U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV1_FLD_SHIFT (0x00000007U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV1_FLD_MAX (0x000001FFU)

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_NB_INDICATIONS_FLD_MASK (0x00070000U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_NB_INDICATIONS_FLD_SHIFT (0x00000010U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_NB_INDICATIONS_FLD_MAX (0x00000007U)

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV2_FLD_MASK (0x00080000U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV2_FLD_SHIFT (0x00000013U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV2_FLD_MAX (0x00000001U)

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_PHASE_DETECT_SELECTOR_FLD_MASK (0x00700000U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_PHASE_DETECT_SELECTOR_FLD_SHIFT (0x00000014U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_PHASE_DETECT_SELECTOR_FLD_MAX (0x00000007U)

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_BYPASS_MODE_FLD_MASK (0x00800000U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_BYPASS_MODE_FLD_SHIFT (0x00000017U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_BYPASS_MODE_FLD_MAX (0x00000001U)

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_LOCK_MODE_FLD_MASK (0x01000000U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_LOCK_MODE_FLD_SHIFT (0x00000018U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_LOCK_MODE_FLD_MAX (0x00000001U)

#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV3_FLD_MASK (0xFE000000U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV3_FLD_SHIFT (0x00000019U)
#define OSPI_PHY_MASTER_CONTROL_REG_PHY_MASTER_CONTROL_RESV3_FLD_MAX (0x0000007FU)

/* DLL_OBSERVABLE_LOWER_REG */

#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_FLD_MASK (0x00000001U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_FLD_SHIFT (0x00000000U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_FLD_MAX (0x00000001U)

#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOCK_MODE_FLD_MASK (0x00000006U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOCK_MODE_FLD_SHIFT (0x00000001U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOCK_MODE_FLD_MAX (0x00000003U)

