TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_ospi.h
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_UNLOCK_COUNTER_FLD_MASK (0x000000F8U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_UNLOCK_COUNTER_FLD_SHIFT (0x00000003U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_UNLOCK_COUNTER_FLD_MAX (0x0000001FU)

#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOCK_VALUE_FLD_MASK (0x00007F00U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOCK_VALUE_FLD_SHIFT (0x00000008U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOCK_VALUE_FLD_MAX (0x0000007FU)

#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOOPBACK_LOCK_FLD_MASK (0x00008000U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOOPBACK_LOCK_FLD_SHIFT (0x0000000FU)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_LOOPBACK_LOCK_FLD_MAX (0x00000001U)

#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_DEC_FLD_MASK (0x00FF0000U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_DEC_FLD_SHIFT (0x00000010U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_DEC_FLD_MAX (0x000000FFU)

#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_INC_FLD_MASK (0xFF000000U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_INC_FLD_SHIFT (0x00000018U)
#define OSPI_DLL_OBSERVABLE_LOWER_REG_DLL_OBSERVABLE_LOWER_DLL_LOCK_INC_FLD_MAX (0x000000FFU)

/* DLL_OBSERVABLE_UPPER_REG */

#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE__UPPER_RX_DECODER_OUTPUT_FLD_MASK (0x0000007FU)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE__UPPER_RX_DECODER_OUTPUT_FLD_SHIFT (0x00000000U)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE__UPPER_RX_DECODER_OUTPUT_FLD_MAX (0x0000007FU)

#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_RESV1_FLD_MASK (0x0000FF80U)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_RESV1_FLD_SHIFT (0x00000007U)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_RESV1_FLD_MAX (0x000001FFU)

#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_TX_DECODER_OUTPUT_FLD_MASK (0x007F0000U)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_TX_DECODER_OUTPUT_FLD_SHIFT (0x00000010U)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_TX_DECODER_OUTPUT_FLD_MAX (0x0000007FU)

#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_RESV2_FLD_MASK (0xFF800000U)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_RESV2_FLD_SHIFT (0x00000017U)
#define OSPI_DLL_OBSERVABLE_UPPER_REG_DLL_OBSERVABLE_UPPER_RESV2_FLD_MAX (0x000001FFU)

/* OPCODE_EXT_LOWER_REG */

#define OSPI_OPCODE_EXT_LOWER_REG_EXT_STIG_OPCODE_FLD_MASK       (0x000000FFU)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_STIG_OPCODE_FLD_SHIFT      (0x00000000U)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_STIG_OPCODE_FLD_MAX        (0x000000FFU)

#define OSPI_OPCODE_EXT_LOWER_REG_EXT_POLL_OPCODE_FLD_MASK       (0x0000FF00U)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_POLL_OPCODE_FLD_SHIFT      (0x00000008U)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_POLL_OPCODE_FLD_MAX        (0x000000FFU)

#define OSPI_OPCODE_EXT_LOWER_REG_EXT_WRITE_OPCODE_FLD_MASK      (0x00FF0000U)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_WRITE_OPCODE_FLD_SHIFT     (0x00000010U)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_WRITE_OPCODE_FLD_MAX       (0x000000FFU)

#define OSPI_OPCODE_EXT_LOWER_REG_EXT_READ_OPCODE_FLD_MASK       (0xFF000000U)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_READ_OPCODE_FLD_SHIFT      (0x00000018U)
#define OSPI_OPCODE_EXT_LOWER_REG_EXT_READ_OPCODE_FLD_MAX        (0x000000FFU)

/* OPCODE_EXT_UPPER_REG */

#define OSPI_OPCODE_EXT_UPPER_REG_OPCODE_EXT_UPPER_RESV1_FLD_MASK (0x0000FFFFU)
#define OSPI_OPCODE_EXT_UPPER_REG_OPCODE_EXT_UPPER_RESV1_FLD_SHIFT (0x00000000U)
#define OSPI_OPCODE_EXT_UPPER_REG_OPCODE_EXT_UPPER_RESV1_FLD_MAX (0x0000FFFFU)

#define OSPI_OPCODE_EXT_UPPER_REG_EXT_WEL_OPCODE_FLD_MASK        (0x00FF0000U)
#define OSPI_OPCODE_EXT_UPPER_REG_EXT_WEL_OPCODE_FLD_SHIFT       (0x00000010U)
#define OSPI_OPCODE_EXT_UPPER_REG_EXT_WEL_OPCODE_FLD_MAX         (0x000000FFU)

#define OSPI_OPCODE_EXT_UPPER_REG_WEL_OPCODE_FLD_MASK            (0xFF000000U)
#define OSPI_OPCODE_EXT_UPPER_REG_WEL_OPCODE_FLD_SHIFT           (0x00000018U)
#define OSPI_OPCODE_EXT_UPPER_REG_WEL_OPCODE_FLD_MAX             (0x000000FFU)

/* MODULE_ID_REG */

#define OSPI_MODULE_ID_REG_CONF_FLD_MASK                         (0x00000003U)
#define OSPI_MODULE_ID_REG_CONF_FLD_SHIFT                        (0x00000000U)
#define OSPI_MODULE_ID_REG_CONF_FLD_MAX                          (0x00000003U)

#define OSPI_MODULE_ID_REG_MODULE_ID_RESV_FLD_MASK               (0x000000FCU)
#define OSPI_MODULE_ID_REG_MODULE_ID_RESV_FLD_SHIFT              (0x00000002U)
#define OSPI_MODULE_ID_REG_MODULE_ID_RESV_FLD_MAX                (0x0000003FU)

#define OSPI_MODULE_ID_REG_MODULE_ID_FLD_MASK                    (0x00FFFF00U)
#define OSPI_MODULE_ID_REG_MODULE_ID_FLD_SHIFT                   (0x00000008U)
#define OSPI_MODULE_ID_REG_MODULE_ID_FLD_MAX                     (0x0000FFFFU)

#define OSPI_MODULE_ID_REG_FIX_PATCH_FLD_MASK                    (0xFF000000U)
#define OSPI_MODULE_ID_REG_FIX_PATCH_FLD_SHIFT                   (0x00000018U)
#define OSPI_MODULE_ID_REG_FIX_PATCH_FLD_MAX                     (0x000000FFU)


#ifdef __cplusplus
}
#endif

#endif /* _HW_OSPI_H_ */
